// تعریف تمام محتواها در یک شیء واحد
export const COLUMN_CONTENTS = {
    SET_EVENTS: (
        <p style={{ fontSize: '12pt', margin: 0, lineHeight: '1.5' }}>
            رویدادهایی که برای آنها لاگ ثبت می‌شود را مشخص نمایید
            <span style={{ fontSize: '11pt' }}>.</span>
        </p>
    ),
    USER_INFO: (
        <p style={{ fontSize: '12pt', margin: 0, lineHeight: '1.5' }}>
            اطلاعات کاربری سیستم
            <span style={{ fontSize: '11pt' }}>.</span>
        </p>
    ),
    SYSTEM_STATUS: (
        <p style={{ fontSize: '12pt', margin: 0, lineHeight: '1.5' }}>
            وضعیت سلامت سرور
            <span style={{ fontSize: '11pt' }}>.</span>
        </p>
    ),
};


// constants.js
export const TABLE_ROWS_DATA = [
    { id: 'row_1', text: 'شروع و اتمام توابع' },
    { id: 'row_2', text: 'تلاشهای ناموفق برای خواندن اطلاعات از ركوردهای لاگ' },
    { id: 'row_3', text: 'خواندن اطلاعات از ركوردهای لاگ' },
    { id: 'row_4', text: 'تمامی تغییرات در پیكربندی لاگ' },
    { id: 'row_5', text: 'عملیات انجام شده به دلیل سرریز حافظه لاگ از حد آستانه' },
    { id: 'row_6', text: 'عملیات انجام شده به دلیل شكست در ذخیره‌سازی لاگها' },
    { id: 'row_7', text: 'تلاش‌های موفقیت‌آمیز برای بررسی صحت داده‌ی کاربری، شامل نتایج بررسی .' },
    { id: 'row_8', text: 'تمام كاربردهای سازوكار احراز هویت' },
    { id: 'row_9', text: 'نتایج نهایی عملیات احراز هویت' },
    { id: 'row_10', text: 'تلاش موفق و ناموفق هر كلمه عبور تست شده توسط محصول' },
    { id: 'row_11', text: 'شکست و موفقیت انقیاد مشخصه‌های امنیتی کاربر به موجودیت فعال ( مانند شکت و موفقیت ایجاد موجودیت فعال )' },
    { id: 'row_12', text: 'تمامی تغییرات بر روی مقادیر مشخصه‌های امنیتی' },
    { id: 'row_13', text: 'تمامی درخواستهای ( موفق و ناموفق ) برای اجرای عملیات بر روی یك موجودیت غیرفعال محصول' },
    { id: 'row_14', text: 'تمامی تلاش‌ها برای وارد کردن داده‌های کاربری ( شامل هرگونه مشخصه‌های امنیتی )' },
    { id: 'row_15', text: 'همه تلاش‌ها برای خارج كردن اطلاعات از محصول' },
    { id: 'row_16', text: 'تمامی تغییرات در رفتارهای توابع كاركردی محصول' },
    { id: 'row_17', text: 'استفاده از كاركردهای مدیریتی' },
    { id: 'row_18', text: 'تغییرات در گروه كاربران' },
    { id: 'row_19', text: 'شكست در كاركردهای امنیتی محصول' },
    { id: 'row_20', text: 'تمامی قابلیت‌هایی از محصول كه به دلیل شكست، نمی‌توانند عملیات موردنظر را انجام دهند .' },
    { id: 'row_21', text: 'تلاش موفق یا ناموفق برای برقراری نشست .' },
    { id: 'row_22', text: 'عدم ایجاد نشست به دلیل محدودیت نشست‌های هم‌زمان ( حداقل )' },
    { id: 'row_23', text: 'خاتمه دادن به یك نشست غیرفعال توسط سازوكار قفل نشست' },
    { id: 'row_24', text: 'خاتمه به نشست غیرفعال توسط مدیر سیستم' },
    { id: 'row_25', text: 'سایر موارد' }
];
